marshall_hub/app/controllers/cases_controller.rb

SELECT "cases".* FROM "cases"
---
  def index
    @cases = Case.all

INSERT INTO "cases" ("victim_name", "victim_age", "victim_ethnic", "incident_location", "charges", "description", "detained", "cops_present", "photo_url", "officer_name", "office_age", "officer_ethnic", "officer_nature", "miranda_rights", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    @case = Case.new(case_params)

    if @case.save

UPDATE "cases" SET "victim_name" = $1, "photo_url" = $2, "user_id" = $3, "updated_at" = $4 WHERE "cases"."id" = $5  [["victim_name", "Roxanne Millers"], ["photo_url", "https://place-hold.it/300"], ["user_id", 11], ["updated_at", "2020-03-18 15:30:23.822973"], ["id", 1]]
---
  def update
    if @case.update(case_params)

DELETE FROM "cases" WHERE "cases"."id" = $1  [["id", 1]]
---
  def destroy
    @case.destroy

SELECT "cases".* FROM "cases" WHERE "cases"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def set_case
      @case = Case.find(params[:id])